Repository: 84000/data-translation-memory
Catalog: toh114-v1.tmx
Source language: bo
Languages: en

source: འཆང་བ་དང་། ཀློག་པ་དང་། ཡི་གེར་འདྲི་བ་དང་། ཡི་གེར་འདྲིར་སྩོལ་བ་དང་།
en: holding it, reading it aloud, writing it down, commissioning it to be written,

source: གོས་དང་། རྒྱན་གྱི་མཆོད་པ་ཆེན་པོ་དག་གིས་མཆོད་པར་བགྱིད་པ་དང་། རྒྱན་གྱིས་བརྒྱན་ནས་
en: worshiping it with great offerings of clothes and ornaments, and adorning it with ornaments!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: At that point, the bodhisattva noble Avaloki­teśvara exclaimed,

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་མཐུ་ཆེ་སྟེ།
en: “Blessed One, this Dharma teaching has great power!

source: དེ་བཞིན་གཤེགས་པའི་ཕྲིན་ལས་བགྱིད་པ་ལགས་སོ། །
en: It performs the Thus-Gone One’s activity!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་རྒྱལ་བ་ཅན་ཞེས་བྱ་བའི་གཟུངས་ཡོད་དེ།
en: “Noble son,” replied the Blessed One,

source: དེ་ནི་ང་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་ན་དེ་བཞིན་གཤེགས་པ་རྒྱལ་བའི་དབྱངས་ལས་བླངས་ཏེ།
en: “I have a dhāraṇi called victorious that I received from the Thus-Gone One Jayaghoṣa when I was a bodhisattva.

source: ཐོབ་པའི་མོད་ལ་ཡང་ས་བཅུ་ཐོབ་པར་གྱུར་ལ། སྲོག་ཆགས་སྟོང་ཕྲག་དུ་མས་ཀྱང་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: As soon as I obtained it, I reached the tenth level and many thousands of beings reached the level where they become receptive to the unborn nature of phenomena.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གཟུངས་མཐུ་ཆེན་པོ་བསྟན་པར་གསོལ།
en: “Blessed One, please teach us that powerful dhāraṇī!” pleaded the bodhisattvas.

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བྱ་ཀ་ལ་པིང་ཀའི་སྒྲ་དང་གདངས་སྒྲོགས་པས་གཟུངས་འདི་བཀའ་སྩལ་པ།
en: The Blessed One, the Thus-Gone One, then uttered this dhāraṇī with the sound and intonation of a kalaviṅka bird:

source: ཏད་ཡ་ཐཱ། ཛ་ཡ་ཛ་ཡ། ཛ་ཡ་བ་ཧ། ཛ་ཡ་བ་ཧ། ཁ་བ་ཧ། ཧུ་ལུ་ཧུ་ལུ། པད་མ་པེ། ཨ་བ་མ་བ་མེ།
en: tadyathā: jaya jaya, jayavaha, khavaha, jayavaha, hulu hulu, padmābhe, avam ava me,

source: ས་ར་ས་ར་ཎེ། དྷི་རི་དྷི་རི། དྷི་རི་དྷི་རི། དེ་བ་ཏཱ་ཨ་ནུ་པཱ་ལཱ་ནི། ཡུད་དྷ་ཨུཏྟཱ་ར་ཎེ། པ་ར་ཙཀྲ་ནི་པ་ར་ཎི།
en: sara saraṇe, dhiri dhiri, dhiri dhiri, devatānupālani, yuddha uttāraṇi, para­cakra­nivāraṇi,

source: པཱུ་ར་ཡ་བྷ་ག་བཱན་སརྦ་ཨཱ་ཤཱ་ན། མ་མ་སརྦ་ཀརྨ་ཀྵཱ་པ་ཡ། བུད་དྷ་ཨ་དྷིཥྛཱ་ནེ་ན་སྭཱ་ཧཱ།
en: pūraya bhagavān sarvāśān, mama sarva­karma kṣapaya, buddhādhiṣṭhānena, svāhā.

source: རིགས་ཀྱི་བུ་འདི་ནི་རྒྱལ་བ་ཅན་ཞེས་བྱ་བའི་གཟུངས་ཡིན་ཏེ། སྡིག་པ་ཐམས་ཅད་ཟད་པར་བྱེད་པ།
en: “Noble son, this is the dhāraṇī called victorious . It exhausts all evil deeds,

source: ནོར་དང་། འབྲུ་རྣམ་པར་འཕེལ་བར་བྱེད་པ། ཕ་རོལ་གྱི་དམག་ཚོགས་ཟློག་པར་བྱེད་པ། མུ་གེའི་གནོད་པ་རབ་ཏུ་ཞི་བར་བྱེད་པ། ཚེ་ནུར་བར་བྱེད་པ་སྟེ།
en: increases wealth, multiplies crops, repels enemy armies, quells the torments caused by famines, and prolongs life.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཡབ་ཡུམ་དང་འདྲ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡིན་ནོ།
en: This Dharma teaching is like the father and mother of all thus-gone ones.

source: རིགས་ཀྱི་བུ་ལ་ལ་ཞིག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དང་། གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་ཚིག་རྣམས་ལ་
en: Noble son, a person who pays homage to this Dharma teaching and the words of this dhāraṇī mantra,

source: ཕྱག་འཚལ་ཞིང་བསམ་པ་ཡོངས་སུ་དག་པས་མཆོད་པར་བྱེད་དེ། ཡི་གེར་འདྲི་བ་དང་། ཡི་གེར་འདྲིར་འཇུག་པ་དང་།
en: who worships it with a pure motivation, writes it down, commissions it to be written,

source: མཆོད་པ་ཆེན་པོས་ཆོས་སྨྲ་བ་དེ་ལ་མཆོད་པ་དེ་ནི་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་ཟད་པར་འགྱུར་རོ། །
en: and venerates those who teach it with great offerings, will eradicate all their karmic obscurations.

source: དུས་མ་ཡིན་པར་འཆི་བས་འཆི་བར་མི་འགྱུར་རོ། ཚེ་འདི་ཉིད་ལ་ཡང་བདེ་བ་མྱོང་བར་འགྱུར་ཏེ།
en: They will not die an untimely death and will experience happiness in this life.

source: བུས་ཡིད་བདེ་བར་འགྱུར་བ་དང་། ཆུང་མས་ཡིད་བདེ་བར་འགྱུར་བ་དང་། ཁྱིམ་གྱིས་ཡིད་བདེ་བར་འགྱུར་བ་དང་།
en: They will feel content with their children, spouse, household,

source: རྒྱལ་སྲིད་ཀྱིས་ཡིད་བདེ་བར་འགྱུར་ལ། བསམ་པ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: or kingdom, and all their aspirations will be fulfilled.”

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་ཕྱག་འཚལ་ལོ། །
en: “I pay homage to this Dharma teaching.

source: ཆོས་སྨྲ་བ་དེ་དག་དང་། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡི་གེར་འདྲི་བ་རྣམས་དང་། འཆང་བ་རྣམས་དང་། ཀློག་པ་རྣམས་ལ་ཡང་མཆོད་པར་འཚལ་ལོ། །
en: I will also worship those who teach it, write it down, hold it, and read it aloud.

source: གང་ལ་ལ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མཆོད་པ་བགྱིད་པ་དང་། ཆོས་སྨྲ་བ་དེ་དག་ལ་ཡང་གོས་དང་། རྒྱན་རྣམས་དང་། གདུགས་དང་། བཞོན་པ་རྣམས་ཀྱིས་མཆོད་པར་བགྱིད་པ་དེ་དག་གིས་ནི། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་མཆོད་པ་བགྱིད་པ་ལགས་སོ། །
en: Those who worship this Dharma teaching and make offerings of clothes, ornaments, parasols, and carriages to the ones who teach it are thereby worshiping all the thus-gone ones.

source: བཅོམ་ལྡན་འདས་དེ་ནི་བདག་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཡང་མཆོད་པའི་མཆོག་གིས་མཆོད་པ་བགྱིད་པ་ལགས་སོ། །
en: Blessed One, to those who worship me and all the bodhisattvas with the highest offerings,

source: རྒྱལ་སྲིད་ཐམས་ཅད་ལ་ཡང་བདག་གིས་བསྲུང་བར་བགྱིའོ། །བསམ་པ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་རྫོགས་པར་བགྱིའོ། །
en: I will grant protection in every kingdom, I will fulfill all their aspirations,

source: རྒྱལ་སྲིད་ཐམས་ཅད་ལ་ཡང་མཆོད་པར་འགྱུར་བར་བགྱིའོ། །
en: and I will make them venerable in every kingdom.

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་ཆོས་ཉན་པ་དེ་དག་གི་དོན་དུ་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་ཚིག་རྣམས་རྗེས་སུ་སྩལ་བར་འཚལ་ལོ། །
en: Blessed One, I will also bestow the words of a dhāraṇī mantra for the sake of those who listen to the Dharma.

source: བསམ་པ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་རྫོགས་པར་བགྱིའོ། །སྙིང་བླས་སུ་ཡང་བགྱིའོ། །
en: I will fulfill all their aspirations. I will care for them.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་སེམས་ཅན་རྣམས་ཀྱི་དོན་གྱི་ཕྱིར་སྨྲོས་ཤིག །
en: “Noble son, speak for the sake of beings!” urged the Blessed One.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེས་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་སྨྲས་སོ། །
en: The bodhisattva Vajrapāṇi then uttered the words of this dhāraṇī mantra:

source: ན་མཿསརྦ་ཏ་ཐཱ་ག་ཏཱ་ནཱཾ། ན་མོ་ཨ་མི་ཏཱ་བྷཱ་ཡ། ཏ་ཐཱ་ག་ཏཱ་ཡ།
en: namaḥ sarva­tathāgatānāṃ, namo ´mitābhāya tathāgatāya,

source: ན་མཿསརྦ་བུད་དྷ་བོ་དྷི་ས་ཏྭཱ་ནཱཾ། ན་མཿསརྦ་མ་ཧཱ་ར་དྷི་ཀེ་བྷྱཿ
en: namaḥ sarva­buddha­bodhi­sattvānāṃ, namaḥ sarva­mahārdhikebhyas.

source: ཏདྱ་ཐཱ། ཧུ་ཧུ་ཧེ་ཧེ། མ་ཏི་མ་ཏི། མ་ཧཱ་མ་ཏི། བཛྲ་མ་ཏི། དྲྀ་ཌྷ་བཛྲ་མ་ཏི།
en: tadyathā: huhu hehe, mati mati, mahā­mati, vajra­mati, dṛḍha­vajra­mati,

source: ཏ་ཐཱ་ག་ཏ་ཨ་ནུ་པ་རི་པཱ་ལི་ཏེ། ས་ར་ས་ར། ཨ་ཡོ་མུ་ཁི་བྷྲྀ་ཀུ་ཊི། བྷྲྀ་ཀུ་ཊ་མུ་ཁི། ཀྲི་པེ་ཀྲི་པཱ་མུ་ཁི།
en: tathāgatānu­paripālite, sara sara, ayomukhi bhṛkuṭi, bhṛkuṭa­mukhi, kṛpe kṛpāluke,

source: ས་ཏྱ་བ་ཙ་ན། མ་ནུ་སྨ་ར། བྷ་ག་བཱན་བཛྲ་པཱ་ཎི། སརྦ་ཀརྨ་ཨཱ་བ་ར་ཎཱ་ནི་ཀྵཱ་པ་ཡ།
en: satya­vacanam anusmara, bhagavan vajra­pāṇi, sarva­karmāvaraṇāni kṣapaya,

source: སརྦ་ཨཱ་ཤ་ཡ་པ་རི་པཱུ་ར་ཡ། དེ་ཧི་མེ་བ་ར་མ། བུད་དྷ་སཏྱེ་ན། བོ་དྷི་སཏྭཱ་སཏྱེ་ན་སྭཱ་ཧཱ།
en: sarvāśāṃ pari­pūraya, dehi me varam buddha­satyena bodhi­sattva­satyena, svāhā.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གང་ལ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ས་བཙལ་འཚལ་བ་དང་། དེ་བཞིན་གཤེགས་པ་བལྟ་བ་དང་།
en: “Venerable Blessed One, those who want to reach the level of a bodhisattva, have a vision of a thus-gone one,

source: སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེ་བ་དང་། རྒྱལ་སྲིད་དང་། ལོངས་སྤྱོད་འཚལ་བ་དང་། ཡུལ་གྲུ་འཚལ་བ་དང་།
en: be reborn in a buddha realm, or gain sovereignty, possessions, lands,

source: ནོར་འཚལ་བ་དང་། འབྲུ་འཚལ་བ་དེས་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དང་། ཆོས་སྨྲ་བ་དེ་ལ་མཆོད་པ་ཆེན་པོས་མཆོད་པར་བགྱིའོ།
en: wealth, or crops should worship this Dharma teaching and those who teach it with vast offerings.

source: མཆོད་པར་བགྱི་སྟེ། །
en: They should also worship

source: གང་ཡི་གེར་འདྲི་བ་དང་། འཆང་བ་དང་། ཀློག་པ་དེ་ལ་ཡང་སྤོས་དང་། མེ་ཏོག་ཕྲེང་དང་།
en: those who write it down, hold it, and read it aloud, with gifts of perfumes, flower garlands,

source: བྱུག་པ་དང་། མལ་ཆ་དང་། སྟན་དང་། གོས་དང་། རྒྱན་རྣམས་དང་། གདུགས་དང་། བཞོན་པ་རྣམས་ཀྱིས་
en: ointments, bedding, cushions, clothes, ornaments, parasols, and carriages.

source: བཅོམ་ལྡན་འདས་དེ་ལ་ནི་བདག་གིས་བསྲུང་བར་བགྱིའོ། །རྒྱལ་སྲིད་ཐམས་ཅད་ལ་ཡང་ཆེས་མཆོད་པར་འགྱུར་བར་བགྱིའོ། །
en: Blessed One, I will protect them and make them highly venerable in every kingdom.

source: ཇི་ལྟར་འཚལ་བ་བཞིན་དུ་སེམས་དང་། ཡིད་བདེ་བར་བགྱིའོ། །
en: I will provide them with all the happiness they wish for,

source: བུ་གཅིག་པ་བཞིན་དུ་ཡོངས་སུ་བསྐྱང་བར་བགྱིའོ། །
en: and I will look after each of them as if they were my only child.

source: གང་ལ་ལ་བདག་མཐོང་བར་འཚལ་བ་དང་། སྟོབས་ཀྱིས་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་བ་དང་། ཏིང་ངེ་འཛིན་འཐོབ་པ་དང་།
en: “Those who wish to have a vision of me, become a powerful monarch, attain the state of meditative absorption,

source: ཐོས་པ་འཛིན་པར་འགྱུར་བ་དང་། ཁམས་རྣམ་པར་སྨིན་པར་འགྱུར་བ་དང་། ལུས་མི་སྣང་བར་འགྱུར་བ་དང་། ནམ་མཁའ་ལས་མཆི་བར་འཚལ་བ་དེས་ནི་
en: have the ability to retain what they hear, transmute minerals, become invisible, and fly through the sky,

source: ཟླ་བ་ཡར་གྱི་ངོ་ཚེས་བརྒྱད་ལ་ཉིན་མཚན་དུ་སྨྱུང་བ་བགྱིས་ལ་གཟུགས་བགྱིད་དུ་སྩལ་ཏེ།
en: should fast for an entire day and night on the eighth day of the waxing moon.

source: རྡོ་རྗེ་འཆང་གི་གཟུགས་འདམ་བུ་མདའ་རྒྱུའི་མདོག་ཅན་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ།
en: They should then make an image of Vajradhara in the color of a reed. It should be adorned with every ornament,

source: ཞི་བའི་ཚུལ་ཅན་སྐུ་གདུང་དང་ལྡན་པར་བགྱིའོ།
en: have a peaceful appearance, and be filled with relics.

source: དབུས་སུ་ནི་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་བཞུགས་པར་བགྱིའོ།
en: The Thus-Gone One, Śākyamuni, should be placed at the center

source: གཡས་ལོགས་སུ་ནི་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལག་པ་བཞི་པ་
en: and the noble four-armed Avaloki­teśvara to the right.

source: རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། སྐུ་གདུང་དང་བཅས་པ་གཞག་གོ། །
en: The latter should also be adorned with every ornament and filled with relics.

source: གཡས་གཡོན་དག་ཏུ་ནི་རྒྱལ་པོ་ཆེན་པོ་བཞི་མཆོད་པ་བགྱིད་པ་གཞག་གོ། །
en: The Four Great Kings should be present on the left and right sides, in postures of worship.

source: སྒྲུབ་པ་པོའི་རིགས་ཀྱི་བུ་དེས་ཀྱང་གཙང་སྦྲ་བགྱི་བ་དང་། དུས་གསུམ་དུ་ཁྲུས་བགྱི་བ་དང་། དུས་གསུམ་དུ་གོས་བརྗེ་བར་བགྱིའོ། །
en: “Those of noble family who engage in this practice must maintain ritual purity, make ablutions, and change their clothes three times a day.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཡང་བྱམས་པའི་སེམས་སུ་བགྱིའོ། །
en: They should cultivate a loving attitude toward all beings.

source: ཟླ་བ་ཡར་གྱི་ངོ་ཚེས་བརྒྱད་ནས་བརྩམས་ཏེ། ཟླ་བ་ཕྱི་མ་ཉ་བ་ཚེས་བཅོ་ལྔའི་བར་དུ་
en: From the eighth day of the waxing moon until the full moon of the following month,

source: ཟས་སུ་ནས་ཀྱི་འོ་ཐུག་འཚལ་ཞིང་། དུས་གསུམ་དུ་བཟླས་བརྗོད་བགྱིའོ། །
en: they must only eat rice porridge and barley, recite the mantra three times a day,

source: བདུག་པ་ནི་ཨ་ག་རུ་དང་། ཙན་དན་དང་། ཅེ་པོག་དང་། གུ་གུལ་དབུལ་ལོ། །
en: and offer incense consisting of aloeswood, sandalwood, frankincense, and myrrh.

source: ལན་སུམ་འབུམ་གྱི་བར་དུ་བཟླས་བརྗོད་བགྱི་སྟེ། དེ་ནི་སྔར་བསྙེན་པ་བགྱི་བ་ལགས་སོ། །
en: They should recite this mantra 300,000 times. This is known as the preparatory recitation.

source: སྐུ་གདུང་དང་ལྡན་པའི་མཆོད་རྟེན་ནམ། དགོན་པའི་གནས་སུ་
en: “At a shrine containing relics, or at a hermitage,

source: སྤོས་དང་། བདུག་པ་དང་། མེ་ཏོག་སྣ་ཚོགས་དང་། བ་དན་སྣ་ཚོགས་ཀྱིས་ཀྱང་མཆོད་པར་བགྱིའོ། །
en: they should perform worship with various types of incense, perfumes, flowers, and flags,

source: དཀར་བག་གི་ལྷ་བཤོས་དག་ཀྱང་དབུལ་བར་བགྱིའོ། །
en: and should offer divine food made of white flour.

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་ཡི་གེར་འདྲིར་སྩལ་ཅིང་། གོས་དང་། རྒྱན་དང་། ལྷབ་ལྷུབ་དང་། གདུགས་དང་། བཞོན་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་མཆོད་པ་བགྱིའོ། །
en: They should also commission this Dharma teaching to be written, and worship it with various clothes, ornaments, scarves, parasols, and carriages.

source: དེ་ནས་ཟླ་བ་ཉ་བ་ཚེས་བཅོ་ལྔའི་བར་དུ་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེའི་སེམས་དང་ལྡན་པ་དང་།
en: Until the date of the full moon, they must keep a compassionate attitude toward all beings,

source: དུས་གསུམ་དུ་ཁྲུས་བགྱི་བ་དང་། དུས་གསུམ་དུ་གོས་བརྗེ་བར་བགྱི་སྟེ།
en: as well as bathe and change clothes three times a day.

source: དཀྱིལ་འཁོར་གྲུ་བཞི་པ་བ་ལང་གི་ལྕི་བས་བསྐུས་ལ་མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་ཁེབས་པར་བགྱི་སྟེ།
en: They should create a square maṇḍala of smeared cow dung, cover it with different kinds of flowers,

source: བུམ་པ་གང་བ་བཅུ་དྲུག་དང་། མར་མེ་བཅུ་དྲུག་ཀྱང་གཞག་པར་བགྱིའོ། །
en: and arrange sixteen filled vases and sixteen lamps.

source: གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་སྣ་ཚོགས་ཀྱིས་ཀྱང་ས་ཕྱོགས་དེ་བརྒྱན་པར་བགྱིའོ། །
en: The space should be adorned with various parasols, victory banners, and flags.

source: རོ་སྣ་ཚོགས་སྦྱར་བའི་ལྷ་བཤོས་རྒྱ་ཆེན་པོ་ཕབ་ལ་སྤོས་ཆབ་ཀྱིས་ཕྱོགས་དེར་ཆག་ཆག་བཏབ་ནས།
en: Having offered various kinds of delicious divine foods and sprinkled the area with scented water,

source: ནམ་སྐུ་གཟུགས་དང་། ས་གཞི་འགུལ་བ་དང་། བདག་ཉིད་ཀྱང་དགའ་བར་གྱུར་པའི་བར་དུ་བཟླས་བརྗོད་བགྱིའོ། །
en: they should recite the mantra until the image and the ground start to shake, and until they experience a state of joy.

source: དེ་ནས་དེས་འདི་ནི་གཅིག་ཏུ་ངེས་པར་འགྲུབ་པར་འགྱུར་རོ་སྙམ་དུ་ཤེས་པར་བགྱིའོ། །
en: They should then know that the practice has definitely succeeded.

source: དེ་ནས་དེའི་འོག་ཏུ་བདག་གིས་རྨི་ལམ་དུ་བསྟན་པར་བགྱི་ཞིང་འབེལ་བའི་གཏམ་བགྱིའོ། །
en: Afterward I will manifest in their dreams and instruct them.

source: བསམ་པ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་རྫོགས་པར་བགྱིའོ། །བུ་གཅིག་པ་བཞིན་དུ་ཡོངས་སུ་བསྐྱང་བར་བགྱིའོ། །
en: I will fulfill all their aspirations and look after each of them as if they were my only child.

source: དམ་པ་ཅི་འཚལ་བ་ཡང་སྩལ་བར་བགྱི་སྟེ། གང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མ་དད་ཅིང་སྤོང་བར་བགྱིད་པ་ནི་མ་གཏོགས་སོ། །
en: I will grant them any boon that they desire, except if they lose faith and abandon this Dharma teaching.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལག་ན་རྡོ་རྗེ་ཁྱོད་ཀྱིས་ཚིག་དེ་སྐད་ཅེས་སྨྲས་པ་ལེགས་སོ་ལེགས་སོ། །
en: “Vajrapāṇi,” declared the Blessed One, “what you have said is excellent, excellent!”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The bodhisattva noble Avaloki­teśvara then said to the bodhisattva Vajrapāṇi,

source: རིགས་ཀྱི་བུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་སེམས་ཅན་བསོད་ནམས་ཆུང་ངུ་རྣམས་ཀྱི་ཡུལ་ན་སྤྱོད་པར་མི་འགྱུར་རོ། །
en: “Noble son, this Dharma teaching will not spread among beings of inferior merit.

source: འདི་ནི་སེམས་ཅན་བསོད་ནམས་ཆུང་ངུ་རྣམས་ཀྱིས་ཡི་གེར་འདྲི་བའམ། ཡི་གེར་འདྲིར་འཇུག་པའམ། འཆང་བའམ། ཀློག་པར་མི་ནུས་ཏེ།
en: They will not be able to write it down, commission it to be written, hold it, or read it aloud;

source: དེ་དག་ལ་བདུད་ཀྱིས་བར་ཆད་བྱེད་པར་འགྱུར་རོ། །
en: Māra will create obstacles for them.

source: རིགས་ཀྱི་བུ་བཞི་པོ་འདི་དག་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡི་གེར་འདྲི་བ་དང་། ཀློག་པ་དང་། ཉན་དུ་འཇུག་པའི་བདུད་ཀྱི་ལས་ཡིན་ཏེ།
en: Noble son, there are four deeds of Māra that create obstacles to the endeavors of writing this Dharma teaching down, reading it aloud, and propagating it.

source: བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལེ་ལོ་དང་། མ་དད་པ་དང་། བླ་མ་ལ་སྲི་ཞུ་མེད་པ་དང་། ཆོས་སྨྲ་བའི་སེམས་མི་བརྟན་པ་སྟེ། །
en: These four are: (1) laziness, ( ) lack of faith, (3) lack of reverence for the master, and (4) a wandering mind when teaching the Dharma.

source: རིགས་ཀྱི་བུ་དེས་དེ་ལ་འདི་ནི་བདུད་ཀྱི་ལས་ཡིན་ནོ། །སྙམ་དུ་ཤེས་པར་བྱའོ།
en: Noble son, you should understand these four to be deeds of Māra.

source: གཞན་ཡང་བདུད་ཀྱི་ལས་བཞི་ཡོད་དེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “There are four other deeds of Māra. These four are:

source: དགེ་བའི་བཤེས་གཉེན་ལ་འདུན་པ་མེད་པ་དང་། ཡིད་ལ་མི་བྱེད་པ་དང་། ཁེངས་པའི་ཚིག་སྨྲ་བ་དང་།
en: taking no interest in a spiritual friend, ( ) not reflecting deeply, (3) harshness in words,

source: འཇིག་རྟེན་འདི་ལ་སེམས་པ་སྟེ། འདི་སྙམ་དུ་འཇིག་རྟེན་འདི་ལ་ཡང་འཇིགས་པ་མེད་དོ། །འཇིག་རྟེན་ཕ་རོལ་ལ་ཡང་འཇིགས་པ་མེད་དོ། །
en: and (4) being caught up in worldly concerns and thinking such things as, ‘I am not afraid of this life or of future ones,’

source: སྡིག་པའི་ལས་རྣམས་ཀྱི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཡང་མེད་དོ། །བདག་ལ་ཚིག་མི་གསལ་བ་ཡང་མེད་དོ།
en: ‘There is no karmic maturation of unwholesome actions,’ ‘No words are unclear to me,’

source: ཡིད་རྟུལ་བ་ཡང་མེད་དོ། །བདག་ནི་མཛེས་པ་ཡིན་ནོ། །བདག་ནི་དབང་ཕྱུག་དང་ལྡན་ནོ་སྙམ་དུ་སེམས་ཤིང་།
en: ‘My mind is not dull,’ ‘I am handsome,’ and ‘I am powerful.’

source: ཁྱིམ་དང་བུ་སྨད་རྣམས་ལ་ཞེན་ཏོ།
en: Such people are attached to their households and families,

source: དེ་དག་ནི་བསྐལ་པ་དུ་མར་སྡུག་བསྔལ་མྱོང་བར་འགྱུར་ཏེ། བཞི་པོ་དེ་དག་ནི་དེ་དག་གི་མི་དགེ་བའི་བཤེས་གཉེན་ཡིན་པར་བལྟ་བར་བྱའོ།
en: and will experience suffering for many eons. These four deeds of Māra should be regarded as non-virtuous friends.

source: ནོར་ལ་བརྐམ་པ་སྟེ། དེ་དག་བསྐལ་པ་དུ་མར་སྡུག་བསྔལ་མྱོང་བར་འགྱུར་བ་དང་། །
en: craving for wealth, which causes suffering for many eons;

source: དེ་དག་མི་དགེ་བའི་བཤེས་གཉེན་དང་དགོད་ཅིང་སྨྲ་བ་དང་།
en: joking and gossiping with non-virtuous spiritual friends;

source: ཆུང་མས་ཡིད་བདེ་བ་དང་། ཆོས་ཉན་པ་དེ་དག་གི་འདུན་པ་ཟློག་པར་བྱེད་པ་སྟེ།
en: being content with one’s spouse; and (4) undermining the interest of those who study the Dharma;

source: འདི་ལྟ་སྟེ། བློན་པོ་དང་། འཁོར་རྣམས་འདུས་པ་དེ་དག་གི་ཐད་དུ་ལྷགས་ནས་འདི་སྐད་དུ་སྦྱིན་པའི་རྣམ་པར་སྨིན་པ་མེད་དོ།
en: that is, going to a place where influential people gather and proclaiming, ‘Generosity produces no karmic result.

source: ཆོས་སྨྲ་བ་འདི་ནི་སྡིག་པ་བྱེད་པ་དབང་ཕྱུག་གི་རྒྱགས་པས་མྱོས་པ་འདོད་པ་ལ་ལོག་པར་གཡེམ་པ།
en: This Dharma teacher is an evildoer! Intoxicated by the arrogance of his powerful status, he indulges in sexual misconduct

source: ཕྲ་མ་ལ་དགའ་བ་ཡིན་ཏེ། འདི་ནི་ཁྱོད་ཀྱི་སྲོག་གི་བར་ཆད་བྱེད་པར་འདོད་ལ། །
en: and delights in divisive speech. He wants to create obstacles to your life.

source: ཁྱོད་ནི་ཆོས་ལ་གནས་པ་སྟེ་ཁྱོད་ཀྱིས་ཆོས་མང་དུ་བྱས་སོ། །
en: But you are a religious person who has practiced a lot of Dharma.

source: ཁྱོད་ནི་མདོ་སྡེ་ཀློག་པ་དང་། འདྲིར་འཇུག་པ་ཡིན་ནོ་ཞེས་འཛེར་ཏེ།
en: You read aloud the sūtras and commission them to be written.’

source: དེ་དག་མདོ་སྡེ་འདི་ཡི་གེར་འདྲིར་འཇུག་པར་མི་བྱེད། མཆོད་པར་མི་བྱེད་དེ།
en: Such people prevent this sūtra from being written down and venerated.

source: དེ་དག་ལ་ནི་ཚེ་འདི་ཉིད་ལ་ཡང་བར་ཆད་མང་པོ་འབྱུང་བར་འགྱུར་ལ་ཕྱི་མ་ལ་ཡང་སེམས་ཅན་དམྱལ་བར་བཙོ་བར་འགྱུར་ཏེ།
en: They will encounter many obstacles in this very life and burn in hell in their future rebirths.

source: དེ་ཡང་རིགས་ཀྱི་བུ་དེས་བདུད་ཀྱི་ལས་ཡིན་པར་རིག་པར་བྱས་ལ་དེའི་དབང་དུ་འགྱུར་བར་མི་བྱའོ། །
en: Noble son, you must understand that these are deeds of Māra, and you must not fall under their influence.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གྲོགས་པོ་དག་ངས་ལན་གཉིས་ལན་གསུམ་དུ་ཚིག་གིས་བསྒོ་སྟེ།
en: “My friends,” said the Blessed One, “I say this repeatedly:

source: བག་ཡོད་པར་གྱིས་ཤིག །ཕྱིས་སེམས་ཅན་དམྱལ་བ་དག་ཏུ་བཙོ་བ་ན་འགྱོད་པར་གྱུར་ཏ་རེ།
en: be heedful, or later, when you are burning in the hell realms, you will have regrets.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །
en: The Blessed One then uttered these verses:

source: ངས་ནི་མདོ་སྡེའི་རྒྱལ་པོ་མང་པོ་བསྟན། །བྱང་ཆུབ་ལ་ནི་སེམས་ཅན་དུ་མ་བཀོད། །
en: “I have taught many kings of sūtras. I have established many beings in the state of awakening.

source: སངས་རྒྱས་ཚུལ་ཡང་ང་ཡིས་བསྟན་པར་གྱུར། །དེ་ཐོས་ནས་ནི་བག་ཀྱང་ཡོད་པར་གྱིས། །
en: I have taught the way of the buddhas. When you hear this, be heedful!

source: ཁྱོད་རྣམས་ཕྱི་དུས་རབ་ཏུ་འཇིག་པའི་ཚེ། །ལོག་པར་ལྟུང་བར་འགྲོ་བར་གྱུར་ཏ་རེ། །
en: “When dark, horrible times come, It is possible to fall into bad states.

source: མདོ་འདི་ལ་ནི་རྟག་ཏུ་གང་དད་པ། །དེ་ནི་ངེས་པར་ང་ཡི་བུ་ཡང་ཡིན། །
en: Those who have unwavering faith in this sūtra Are truly my own children.

source: མདོ་འདི་ལ་ནི་རྟག་ཏུ་གང་མཆོད་པ། །དེ་ནི་སངས་རྒྱས་ཞིང་དུའང་སྐྱེ་བར་འགྱུར། །
en: “Those who continuously worship this sūtra Will be reborn in the buddha realms.

source: གང་ཕྱོགས་མདོ་སྡེའི་རྒྱལ་པོ་འདི་གནས་པ། །དེར་ནི་འབྱུང་པོ་གནོད་སྦྱིན་སྲིན་པོ་དང་། །ཡི་དགས་གྲུལ་བུམ་ལྟོ་འཕྱེ་ཆེན་པོ་དང་། །གཤེད་བྱེད་བྱད་སྟེམས་རྣམས་ཀྱིས་ཡོངས་མི་ཚུགས། །
en: Wherever this king of sūtras is found, No one is harmed by bhūtas, yakṣas, rākṣasas, “Pretas, kumbhāṇḍas, mahoragas, Kṛtyās, or kākhordas.

source: དེ་ནི་བསམ་པ་ཐམས་ཅད་ཡོངས་རྫོགས་ཤིང་། དེ་ནི་བདེ་བར་བྱང་ཆུབ་འཚང་ཡང་རྒྱ། །
en: All their aspirations will be completely fulfilled, And they will easily awaken to buddhahood.”

source: དེའི་ཚེ་རྒྱལ་པོ་ཆེན་པོ་བཞིས་ཚིགས་སུ་བཅད་པ་འདི་དག་ཐོས་ནས། ཆོས་ཀྱི་ཤུགས་ཀྱིས་མཆི་མ་བླགས་ཏེ།
en: When they heard these verses, the Four Great Kings shed tears, moved by the power of the Dharma.

source: ལུས་འདར་བཞིན་དུ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་གཏུགས་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Trembling, they fell at the feet of the Blessed One and said,

source: བཅོམ་ལྡན་འདས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞིས་ཆོས་སྨྲ་བ་དེ་ལ་མཆོད་པར་བགྱིའོ། །ཆོས་ཉན་པ་དེ་དག་ལ་ཡང་བསྲུང་བར་བགྱིའོ། །
en: “Blessed One, we four great kings will worship those who spread this Dharma teaching and protect those who listen to it.

source: བཅོམ་ལྡན་འདས་གང་ལ་ལ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡི་གེར་འདྲི་བ་དང་། ཡི་གེ་འདྲིར་སྩོལ་བ་དང་།
en: Blessed One, we will protect those who write it down and commission it to be written.

source: གཟུངས་འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་།
en: We will also protect those who hold, read aloud, and master the dhāraṇīs,

source: ཆོས་སྨྲ་བ་དེ་ལ་ཡང་གོས་དང་། རྒྱན་དག་གིས་མཆོད་པ་བགྱིད་པ་དེ་ལ་ཡང་བདག་ཅག་གིས་བསྲུང་བར་བགྱིའོ།
en: as well as those who worship such Dharma teachers with clothes and ornaments.

source: དེའི་ཡུལ་ཡང་ཡོངས་སུ་བསྐྱང་བར་བགྱིའོ། །ནོར་དང་འབྲུ་ཐམས་ཅད་ཀྱང་སྩལ་བར་བགྱིའོ། །
en: We will protect their lands. We will grant them all the wealth and crops they desire.

source: བུ་གཅིག་པ་བཞིན་དུ་ཡོངས་སུ་བསྐྱང་བར་བགྱིའོ། །གཡུལ་འགྱེད་པ་ཐམས་ཅད་དུ་ཡང་མདུན་དུ་མཆི་བར་བགྱིའོ། །
en: We will look after each of them as if they were our only child. We will fight in front of them in every battle.

source: རྒྱལ་སྲིད་ཐམས་ཅད་དུ་ཡང་ཆེས་བཀུར་སྟིར་བགྱིད་པར་འགྱུར་བར་བགྱི་སྟེ།
en: We will win for them the highest respect in every kingdom.

source: བདག་ཅག་ནི་དེ་བཞིན་གཤེགས་པ་ལ་བཀའ་དྲིན་གཟོ་བར་བགྱིད་ཀྱི་བཀའ་དྲིན་མི་གཟོ་བར་མི་བགྱིད་ལགས་སོ། །
en: We will remember the kindness of the thus-gone ones; we will not be ungrateful.

source: བཅོམ་ལྡན་འདས་གང་ལ་ལ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་མཆོད་པར་མི་བགྱིད་པ་དང་། །ཆོས་སྨྲ་བ་དེ་དག་ལ་ཡང་མཆོད་པར་མི་བགྱིད་པ་དེ་ལ་ནི་བདག་ཅག་གིས་སེམས་མི་བདེ་བར་བགྱིའོ། །
en: Blessed One, we will cause despair in anyone who hears this Dharma teaching but does not revere it, and who fails to worship those who teach it.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དེ་དག་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། རྒྱལ་པོ་ཆེན་པོ་དག་ལེགས་སོ་ལེགས་སོ། །
en: In response, the Blessed One expressed his approval to the Four Great Kings, saying, “Excellent, excellent, great kings!

source: རྒྱལ་པོ་ཆེན་པོ་དག་ཁྱོད་ལེགས་ཀྱིས་རྟག་ཏུ་ཁྱོད་ཀྱིས་དེ་ལྟར་གྱིས་ཤིག །
en: Great kings, always act in this excellent way!”

source: དེ་ནས་དྲི་ཟའི་བདག་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྲུང་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་གཏུགས་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then the great king of the gandharvas, Dhṛtarāṣṭra, fell at the feet of the Blessed One and said,

source: བཅོམ་ལྡན་འདས་སླད་མའི་དུས་སླད་མའི་ཚེ་སེམས་ཅན་མི་དགེ་བ་སྤྱོད་པ་དང་།
en: “Blessed One, in the future there will be beings who indulge in non-virtue,

source: དེ་བཞིན་གཤེགས་པ་ལ་མ་དད་ཅིང་གློ་བར་མ་ཆུད་པ་དག་ཀྱང་འབྱུང་བར་འགྱུར་ཏེ།
en: who have no faith in the thus-gone ones and lack insight.

source: དེ་དག་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལྟ་བུ་འཛིན་པར་མི་བགྱིད། ཀློག་པར་མི་བགྱིད།
en: They will not memorize such Dharma teachings, nor read them aloud,

source: ཡི་གེར་འདྲིར་སྩོལ་བར་མི་བགྱིད། སྦྱིན་པ་སྦྱིན་པར་མི་བགྱིད།
en: nor commission them to be written. They will not practice generosity,

source: སྦྱིན་པའི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ལ་ཡིད་མི་ཆེས་ཤིང་། འཇིག་རྟེན་འདིའི་བདེ་བ་ལ་ལྟ་བར་བགྱིད་དེ།
en: nor will they believe in the karmic maturation of generosity. They will only be concerned with the happiness of this life.

source: སེམས་ཅན་དེ་ལྟ་བུ་དེ་དག་གི་དོན་དུ་དེ་བཞིན་གཤེགས་པ་དང་འདྲ་བའི་མདོ་སྡེའི་རྒྱལ་པོ་ཆེན་པོ་འདི་བཀའ་སྩལ་ཏོ། །
en: This great king of sūtras, which is equal to the Thus-Gone One, is taught for the sake of beings like these.”
